Repository: zqqw/consolelogga
Catalog: src/po/*.po
Languages: cs, de, es, it, nl, pl, pt, ru

source: consolelogga : logs messages from the console at boot or shutdown Default values, # consolelogga (with no options) : Fork to background, no pidfile, console(s) found in /proc/consoles, log to /var/log/consolelogga.log (if it exists) Examples of use: # consolelogga -xp : foreground with default pidfile # consolelogga --pidpath=/new/path : custom pidfile location # consolelogga -o /new/path : custom logfile location # consolelogga -c"/dev/tty1 /dev/tty2" : write to tty1 & 2
cs: consolelogga : protokoly, zprávy z konzole při startu nebo vypnutí Výchozí hodnoty, # consolelogga (bez možnosti) : Vidlička na pozadí, žádný soubor PID, konzole(y) v /proc/consoles, přihlásit se do /var/log/consolelogga.log (pokud existuje) Příklady použití: # consolelogga -xp : popředí s výchozí PID soubor # consolelogga --pidpath=/nové/cesta : vlastní PID umístění souboru # consolelogga -o /nové/cesta : vlastní umístění souboru protokolu # consolelogga -c"/dev/tty1 /dev/tty2" : napište do tty1 a 2
de: consolelogga : protokolliert Meldungen aus der Konsole zu starten oder Herunterfahren Standardwerte, # consolelogga (ohne Optionen) : Gabel zu hintergrund, ohne pidfile, konsole(n) gefunden in /proc/consoles, log an /var/log/consolelogga.log (wenn es vorhanden ist) Anwendungsbeispiele: # consolelogga -xp : Vordergrund mit Standard-Pidfile # consolelogga --pidpath=/neuer/Pfad : Benutzerdefinierte pidfile location # consolelogga -o /neuer/Pfad : Benutzerdefinierte logfile location # consolelogga -c"/dev/tty1 /dev/tty2" : Schreibe an tty1 & 2
es: consolelogga : los registros de los mensajes de la consola durante el inicio o el apagado Los valores predeterminados, # consolelogga (sin opciones) : Tenedor de fondo, no hay archivo PID, consola(s) se encuentran en /proc/consolas, registro /var/log/consolelogga.log (si es que existe) Ejemplos de uso: # consolelogga -xp : primer plano con la ubicación predeterminada para el archivo PID # consolelogga --pidpath=/nuevo/camino : personalizado de la ubicación del archivo PID # consolelogga -o /nuevo/camino : personalizado ubicación del archivo de registro # consolelogga -c"/dev/tty1 /dev/tty2" : escribir a tty1 y 2
it: consolelogga : registra i messaggi dalla console all'avvio o l'arresto di I valori di Default, # consolelogga (senza opzioni) : Forcella in sottofondo, nessun file PID, console(s) che si trova in /proc/console, log in /var/log/consolelogga.log (se esiste) Esempi di utilizzo: # consolelogga -xp : primo piano con di default del file PID # consolelogga --pidpath=/nuovo/percorso : personalizzato il percorso del file PID # consolelogga -o /nuovo/percorso : personalizzato percorso file di registro # consolelogga -c"/dev/tty1 /dev/tty2" : scrivere a tty1 & 2
nl: consolelogga : logs berichten van de console bij het opstarten of afsluiten Standaard waarden, # consolelogga (zonder opties) : Vork op de achtergrond, geen PID-bestand, en de console(s) van /proc/consoles, loggen naar /var/log/consolelogga.log in (als dit bestaat) Voorbeelden van gebruik: # consolelogga -xp : voorgrond met standaard PID-bestand # consolelogga --pidpath=/nieuwe/pad : aangepaste PID bestand locatie # consolelogga -o /nieuwe/pad : aangepast log bestand locatie # consolelogga -c"/dev/tty1 /dev/tty2" : schrijven tty1 & 2
pl: consolelogga : zapisuje komunikaty z konsoli podczas uruchamiania lub zamykania Wartości domyślne, # consolelogga (bez opcji): Widelec do tła, nie ma PID-plik, konsola(y) znaleźć się w /proc/consoles, logi w /var/log/consolelogga.log (jeśli istnieje) Przykłady użycia: # consolelogga -xp : zdjęcia z PID-domyślny plik # consolelogga --pidpath=/nowy/sposób : urząd celny PID lokalizacja pliku # consolelogga -o /nowy/sposób : Niestandardowa lokalizacja pliku dziennika # consolelogga -c"/dev/tty1 /dev/tty2" : napisz tty1 & 2
pt: consolelogga : registra mensagens do console na inicialização ou desligamento\n" Valores padrão, # consolelogga (sem opções) : Forquilha ao fundo, nenhum arquivo pid, console (s) encontrado (s) em /proc/consoles, log para /var/log/consolelogga.log (se existir) Exemplos de uso: # consolelogga -xp : primeiro plano com pidfile padrão # consolelogga --pidpath=/novo/caminho : local do arquivo pid personalizado # consolelogga -o /novo/caminho : local do arquivo de log personalizado # consolelogga -c\"/dev/tty1 /dev/tty2\" : escrever para tty1 & 2
ru: consolelogga : записывает сообщения из консоли при загрузке или завершении работы Значение по умолчанию, # consolelogga (без вариантов) : Вилка для фона, нет файлом PID, консоль(ы) найти в /proc/consoles, лог в /var/log/consolelogga.log (если он существует) Пример использования: # consolelogga -xp : передний план с файлом PID по умолчанию # consolelogga --pidpath=/new/path : пользовательское расположение файлом PID # consolelogga -o /new/path : пользовательское расположение файла лог # consolelogga -c"/dev/tty1 /dev/tty2" : написать в tty1 & 2

source: consolearg
cs: konzole argumenty
de: argument
es: consola argumento
it: console argomento
pl: argumenty konsoli
pt: argumento
ru: аргументы консоли

source: Write to custom console(s)
cs: Napište vlastní konzole(s)
de: Schreiben Sie an benutzerdefinierte Konsole(n)
es: Escribir en consola personalizada o varias consolas
it: Scrivere per console personalizzata(s)
nl: Schrijf aangepaste console(s)
pl: Napisz niestandardową konsolę(y)
pt: Escrever no(s) console(s) personalizado(s)
ru: Запись в пользовательскую консоль или консоли

source: Run as a foreground process, don't fork
cs: Běží jako proces v popředí, ne vidličku
de: Fuhren Sie als Vordergrund Prozess, Gabel nicht
es: Ejecutar como un proceso de primer plano, no horquilla
it: Eseguito come processo in primo piano, non la forcella
nl: Als een voorgrond proces, niet voorvork
pl: Działa jako zwykły proces, nie wtyczka
pt: Executar como um processo em primeiro plano, não garfo
ru: Запуск как процесс переднего плана, не вилки

source: Write a pidfile to default location
cs: Napsat PID soubor do výchozího umístění
de: Schreiben Sie eine pidfile auf den Standardspeicherort
es: Escribir un PID archivo en la ubicación predeterminada
it: Scrivere un file PID di posizione predefinita
nl: Het schrijven van een PID-bestand naar de standaard locatie
pl: Napisz PID-plik w folderze domyślnym
pt: Escreva um arquivo pid no local padrão
ru: Написать PID-файл в папку по умолчанию

source: Log messages without a timestamp
cs: Zprávy protokolu bez časového razítka
de: Protokollieren Nachrichten ohne Zeitstempel
es: Los mensajes de registro sin una marca de tiempo
it: I messaggi di Log senza un timestamp
nl: Log berichten zonder een tijdstempel
pl: Wiadomości dziennika bez etykiety
pt: Registrar mensagens sem um carimbo de data / hora
ru: Сообщения журнала без метки времени

source: /path/to/pid
cs: /cesta/k/PID
de: /Pfad/zur/Datei
es: /ruta/a/PID
it: /il/percorso/PID
nl: /pad/naar/PID
pl: /ścieżka/do/PID
pt: /caminho/para/pid
ru: /путь/к/PID

source: Define pidfile location
cs: Definovat umístění souboru PID
de: Pidfile location definieren
es: Definir la ubicación del archivo de PID
it: Definire il percorso del file PID
nl: Het definiëren van de PID-bestand locatie
pl: Określić PID lokalizacja pliku
pt: Definir localização do arquivo pid
ru: Определение расположения файла PID

source: /path/to/log
cs: /cesta/k/protokolu
de: /Pfad/zur/Datei
es: /ruta/a/registro
it: /il/percorso/registro
nl: /pad/naar/log
pl: /ścieżka/do/magazyn
pt: /caminho/para/log
ru: /путь/к/лог

source: Define log file location
cs: Definovat umístění souboru protokolu
de: Definieren Sie den Speicherort der Protokolldatei
es: Definir la ubicación del archivo de registro
it: Definire il percorso del file registro
nl: Het definiëren van de log-bestand locatie
pl: Określ lokalizację pliku dziennika
pt: Definir localização do arquivo de log
ru: Определение расположения файла лог

source: sigaction failure at cleanup
cs: sigaction selhání na vyčištění
de: Sigaction scheiterte bei bereinigung
es: sigaction el fracaso en la limpieza
it: sigaction fallimento di pulitura
nl: sigaction fout op opruiming
pl: odmowa sigaction w sprzątaniu
pt: falha de sigaction na limpeza
ru: отказ в sigaction в уборке

source: xmalloc virtual memory exhausted
cs: xmalloc virtuální paměť vyčerpána
de: xmalloc virtueller Speicher erschöpft
es: xmalloc la memoria virtual agotado
it: xmalloc memoria virtuale esaurita
nl: xmalloc virtueel geheugen is uitgeput
pl: wirtualny xmalloc pamięć wyczerpany
pt: memória virtual xmalloc esgotada
ru: xmalloc виртуальная память исчерпана

source: xrealloc virtual memory exhausted
cs: xrealloc virtuální paměť vyčerpána
de: xrealloc virtueller Speicher erschöpft
es: xrealloc la memoria virtual agotado
it: xrealloc memoria virtuale esaurita
nl: xrealloc virtueel geheugen is uitgeput
pl: wirtualny xrealloc pamięć wyczerpany
pt: memória virtual xrealloc esgotada
ru: xrealloc виртуальная память исчерпана

source: fopen failed to open log_file
cs: fopen nepodařilo se otevřít log_file
de: fopen konnte log_file nicht öffnen
es: fopen no se pudo abrir log_file
it: fopen impossibile aprire log_file
nl: fopen niet openen log_file
pl: funkcje fopen nie udało się otworzyć log_file
pt: fopen falhou ao abrir log_file
ru: fopen не удалось открыть log_file

source: pidfile unlink failed in cleanup
cs: PID souboru unlink nepodařilo ve vyčištění
de: pidfile unlink fehlgeschlagen beim bereinigen
es: archivo pid 'unlink' error en la limpieza
it: unlink PID file fallito la pulizia
nl: unlink PID-bestand is mislukt in de opruiming
pl: błąd : PID-plik unlink sprzątanie nie działało
pt: falha de pidfile unlink na limpeza
ru: unlink файла PID не удалось очистить

source: rmdir failed in cleanup
cs: rmdir nepodařilo na vyčištění
de: rmdir fehlgeschlagen beim bereinigen
es: rmdir error en la limpieza
it: rmdir fallito la pulizia
nl: rmdir is mislukt in de opruiming
pl: funkcje rmdir nie powiodło się podczas czyszczenia
pt: falha de rmdir na limpeza
ru: rmdir не удалось очистить

source: Fatal signal not fatal - terminating
cs: Fatální signál není fatální - ukončení
de: Tödliches Signal nicht tödlich - beendet
es: Señal Fatal no fatal - ahora terminación
it: Segnale fatale e non fatale - fatale
nl: Fatale signaal niet fatale - terminating
pl: Fatalny sygnał nie śmiertelnie - zakończenia
pt: Sinal fatal não fatal - terminando
ru: Фатальный сигнал не смертельный - прекращается

source: Fork failed
cs: Vidlice selhalo
de: Gabel scheiterte
es: Tenedor ha fallado
it: La forcella non è riuscito
nl: Vork is mislukt
pl: Widelec nieudany
pt: Falha na forquilha
ru: Вилка не удалась

source: setsid failed
cs: setsid selhalo
de: setsid scheiterte
es: setsid ha fallado
it: setsid fallito
nl: setsid mislukt
pl: funkcje setsid nieudany
pt: setsid falhou
ru: setsid не удалась

source: Second fork failed
cs: Druhý vidlice selhalo
de: Zweite Gabel scheiterte
es: Segundo tenedor ha fallado
it: Secondo la forcella non è riuscito
nl: Tweede vork mislukt
pl: Drugie widelec nie powiodło się
pt: Segunda bifurcação falhou
ru: Вторая вилка не удалась

source: chdir failed
cs: chdir selhalo
de: chdir scheiterte
es: chdir ha fallado
it: chdir fallito
nl: chdir mislukt
pl: funkcje chdir nieudany
pt: chdir falhou
ru: chdir не удалась

source: Can't open pty - terminal failure
cs: Nelze otevřít pty - terminální selhání
de: Kann nicht öffnen pty, Terminal Ausfall
es: No se puede abrir pty - fallo fatal
it: Non si può aprire pty - terminale guasto
nl: Kan het niet openen van pty - aansluiting storing
pl: Nie mogę otworzyć pty - awaria terminala
pt: Não é possível abrir pty - erro fatal
ru: Не удается открыть pty - терминал сбой

source: Can't get console output, consolelogga already running?
cs: Nemůže dostat výstup na konzoli, consolelogga již běží?
de: Kann keine Konsolenausgabe erhalten, consolelogga läuft schon?
es: No se puede obtener la salida de la consola, consolelogga ya en funcionamiento?
it: Non è possibile ottenere l'output della console, consolelogga già in esecuzione?
nl: Kan het niet krijgen console-uitvoer, consolelogga al uitgevoerd?
pl: Nie mogę odczytać wyjście na konsolę, consolelogga już działa?
pt: Não é possível obter a saída do console, o consolelogga já está em execução?
ru: Не удается получить консольный выход, consolelogga уже запущена?

source: Error redirecting console output to pty slave
cs: Chyba přesměrování konzole výstup pty otrok
de: Fehler beim Umleiten der Konsolenausgabe an pty Slave
es: Error de redireccionar la salida de la consola a pty esclavo
it: Errore di reindirizzare l'output della console pty slave
nl: Fout ombuigen van de console-uitvoer naar pty slaaf
pl: Błąd przekierowania wyjścia konsoli w pty niewolnik
pt: Erro ao redirecionar a saída do console para pty slave
ru: Ошибка перенаправления выхода консоли в ведомое устройство Pty

source: fopen failed to open pid file
cs: fopen nepodařilo se otevřít PID soubor
de: fopen konnte die pidfile nicht öffnen
es: fopen no se pudo abrir archivo de PID
it: fopen impossibile aprire del file PID
nl: fopen niet open PID-bestand
pl: funkcje fopen nie można otworzyć plik PID
pt: fopen falhou ao abrir o arquivo pid
ru: fopen не удалось открыть файл PID

source: Root isn't a directory
cs: Root není adresář
de: Root ist kein Verzeichnis
es: Root no es un directorio
it: Root non è una directory
nl: Root is geen directory
pl: Korzeń nie jest katalogiem
pt: Root não é um diretório
ru: Корень не каталог

source: Path includes non-directory element
cs: Cesta zahrnuje non-adresář prvek
de: Pfad enthält nicht-Verzeichnis-Element
es: La ruta incluye un no-directorio de elemento
it: Il percorso include la non-directory elemento
nl: Path bestaat niet-directory element
pl: Ścieżka zawiera element, który nie jest katalogiem
pt: O caminho inclui um elemento que não é um diretório
ru: Путь включает элемент, не относящийся к каталогу

source: mkdir - failed to create directory
cs: mkdir - nepodařilo se vytvořit adresář
de: mkdir - fehlgeschlagen Verzeichnis erstellen
es: mkdir - no se pudo crear el directorio
it: mkdir: impossibile creare la directory
nl: mkdir - maken van map mislukt
pl: funkcje mkdir - nie udało się utworzyć katalogu
pt: mkdir - falha ao criar o diretório
ru: mkdir-не удалось создать каталог

source: fopen failed to open /proc/consoles
cs: fopen nepodařilo se otevřít /proc/consoles
de: fopen - Fehler beim öffnen /proc/consoles
es: fopen no se pudo abrir /proc/consoles
it: fopen impossibile aprire /proc/console
nl: fopen niet open /proc/consoles
pl: funkcje fopen nie otwiera /proc/consoles
pt: fopen falhou ao abrir /proc/consoles
ru: fopen не удалось открыть /proc/consoles

source: No consoles found in /proc/consoles
cs: Ne konzole našel v souboru /proc/consoles
de: Keine Konsolen im /proc/consoles gefunden
es: No hay consolas que se encuentra en /proc/consoles
it: Non di console si trovano in /proc/consoles
nl: Geen consoles te vinden in /proc/consoles
pl: Żadna konsola nie znaleźć się w /proc/consoles
pt: Nenhum console encontrado em / proc / consoles
ru: Консолей не найдено в /proc/consoles

source: Unable to open output tty
cs: Nelze otevřít výstupní tty
de: Kann nicht öffnen Ausgabe tty
es: No se puede abrir la salida de tty
it: Impossibile aprire uscita tty
nl: Kan niet openen van tty-uitgang
pl: Nie można otworzyć wyjściowy tty
pt: Não foi possível abrir a saída tty
ru: Не удалось открыть выходной телетайп

source: fcntl F_GETFL failed
cs: fcntl F_GETFL selhalo
de: fcntl F_GETFL scheiterte
es: fcntl F_GETFL ha fallado
it: fcntl F_GETFL fallito
nl: fcntl F_GETFL mislukt
pl: fcntl F_GETFL nieudany
pt: fcntl F_GETFL falhou
ru: fcntl F_GETFL не удалась

source: fcntl F_SETFL failed
cs: fcntl F_SETFL selhalo
de: fcntl F_SETFL scheiterte
es: fcntl F_SETFL ha fallado
it: fcntl F_SETFL fallito
nl: fcntl F_SETFL mislukt
pl: fcntl F_SETFL nieudany
pt: fcntl F_GETFL falhou
ru: fcntl F_SETFL не удалась

source: time returned -1
cs: time vrácena -1
de: time zurückgegeben -1
es: time devuelve -1
it: time restituito -1
nl: time geretourneerd -1
pl: time zwraca wartość -1
pt: time retornou -1
ru: time возвращает значение -1

source: localtime returned NULL
cs: localtime vrácena NULL
de: localtime zurückgegeben NULL
es: localtime devuelve NULL
it: localtime restituito NULL
nl: localtime geretourneerd -1
pl: localtime zwraca wartość NULL
pt: localtime retornou NULL
ru: localtime возвращает значение NULL
